microsoft/uf2-samdx1/lib/samd51/atdf/ATSAMD51J20A.atdf
        <register name="INTFLAG" offset="0x18" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x00" caption="SPI Interrupt Flag Status and Clear">
          <bitfield name="DRE" caption="Data Register Empty Interrupt" mask="0x1"/>
          <bitfield name="TXC" caption="Transmit Complete Interrupt" mask="0x2"/>
          <bitfield name="RXC" caption="Receive Complete Interrupt" mask="0x4"/>
          <bitfield name="SSL" caption="Slave Select Low Interrupt Flag" mask="0x8"/>
          <bitfield name="ERROR" caption="Combined Error Interrupt" mask="0x80"/>
        </register>
        <register name="STATUS" offset="0x1A" rw="RW" size="2" initval="0x0000" caption="SPI Status">
          <bitfield name="BUFOVF" caption="Buffer Overflow" mask="0x4"/>
          <bitfield name="LENERR" caption="Transaction Length Error" mask="0x800"/>
        </register>
        <register name="SYNCBUSY" offset="0x1C" rw="R" size="4" initval="0x00000000" caption="SPI Synchronization Busy">
          <bitfield name="SWRST" caption="Software Reset Synchronization Busy" mask="0x1"/>
          <bitfield name="ENABLE" caption="SERCOM Enable Synchronization Busy" mask="0x2"/>
          <bitfield name="CTRLB" caption="CTRLB Synchronization Busy" mask="0x4"/>
          <bitfield name="LENGTH" caption="LENGTH Synchronization Busy" mask="0x10"/>
        </register>
        <register name="LENGTH" offset="0x22" rw="RW" size="2" initval="0x0000" caption="SPI Length">
          <bitfield name="LEN" caption="Data Length" mask="0xFF"/>
          <bitfield name="LENEN" caption="Data Length Enable" mask="0x100"/>
        </register>
        <register name="ADDR" offset="0x24" rw="RW" size="4" initval="0x00000000" caption="SPI Address">
          <bitfield name="ADDR" caption="Address Value" mask="0xFF"/>
          <bitfield name="ADDRMASK" caption="Address Mask" mask="0xFF0000"/>
        </register>
        <register name="DATA" offset="0x28" rw="RW" size="4" initval="0x00000000" caption="SPI Data">
          <bitfield name="DATA" caption="Data Value" mask="0xFFFFFFFF"/>
        </register>
        <register name="DBGCTRL" offset="0x30" rw="RW" size="1" initval="0x00" caption="SPI Debug Control">
          <bitfield name="DBGSTOP" caption="Debug Mode" mask="0x1"/>
        </register>
      </register-group>
      <register-group name="SERCOM_USART" caption="Serial Communication Interface - USART Mode">
        <register name="CTRLA" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="USART Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="MODE" caption="Operating Mode" mask="0x1C"/>
          <bitfield name="RUNSTDBY" caption="Run during Standby" mask="0x80"/>
          <bitfield name="IBON" caption="Immediate Buffer Overflow Notification" mask="0x100"/>
          <bitfield name="TXINV" caption="Transmit Data Invert" mask="0x200"/>
          <bitfield name="RXINV" caption="Receive Data Invert" mask="0x400"/>
          <bitfield name="SAMPR" caption="Sample" mask="0xE000"/>
          <bitfield name="TXPO" caption="Transmit Data Pinout" mask="0x30000"/>
          <bitfield name="RXPO" caption="Receive Data Pinout" mask="0x300000"/>
          <bitfield name="SAMPA" caption="Sample Adjustment" mask="0xC00000"/>
          <bitfield name="FORM" caption="Frame Format" mask="0xF000000"/>
          <bitfield name="CMODE" caption="Communication Mode" mask="0x10000000"/>
          <bitfield name="CPOL" caption="Clock Polarity" mask="0x20000000"/>
          <bitfield name="DORD" caption="Data Order" mask="0x40000000"/>
        </register>
        <register name="CTRLB" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="USART Control B">
          <bitfield name="CHSIZE" caption="Character Size" mask="0x7"/>
          <bitfield name="SBMODE" caption="Stop Bit Mode" mask="0x40"/>
          <bitfield name="COLDEN" caption="Collision Detection Enable" mask="0x100"/>
          <bitfield name="SFDE" caption="Start of Frame Detection Enable" mask="0x200"/>
          <bitfield name="ENC" caption="Encoding Format" mask="0x400"/>
          <bitfield name="PMODE" caption="Parity Mode" mask="0x2000"/>
          <bitfield name="TXEN" caption="Transmitter Enable" mask="0x10000"/>
          <bitfield name="RXEN" caption="Receiver Enable" mask="0x20000"/>
          <bitfield name="LINCMD" caption="LIN Command" mask="0x3000000"/>
        </register>
        <register name="CTRLC" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="USART Control C">
          <bitfield name="GTIME" caption="Guard Time" mask="0x7"/>
          <bitfield name="BRKLEN" caption="LIN Master Break Length" mask="0x300"/>
          <bitfield name="HDRDLY" caption="LIN Master Header Delay" mask="0xC00"/>
          <bitfield name="INACK" caption="Inhibit Not Acknowledge" mask="0x10000"/>
          <bitfield name="DSNACK" caption="Disable Successive NACK" mask="0x20000"/>
          <bitfield name="MAXITER" caption="Maximum Iterations" mask="0x700000"/>
          <bitfield name="DATA32B" caption="Data 32 Bit" mask="0x3000000"/>
        </register>
        <register name="BAUD" offset="0xC" rw="RW" size="2" initval="0x0000" caption="USART Baud Rate">
          <mode name="DEFAULT_MODE">
            <bitfield name="BAUD" caption="Baud Rate Value" mask="0xFFFF"/>
          </mode>
          <mode name="FRAC_MODE">
            <bitfield name="BAUD" caption="Baud Rate Value" mask="0x1FFF"/>
            <bitfield name="FP" caption="Fractional Part" mask="0xE000"/>
          </mode>
          <mode name="FRACFP_MODE">
            <bitfield name="BAUD" caption="Baud Rate Value" mask="0x1FFF"/>
            <bitfield name="FP" caption="Fractional Part" mask="0xE000"/>
          </mode>
          <mode name="USARTFP_MODE">
            <bitfield name="BAUD" caption="Baud Rate Value" mask="0xFFFF"/>
          </mode>
        </register>
        <register name="RXPL" offset="0xE" rw="RW" size="1" initval="0x00" caption="USART Receive Pulse Length">
          <bitfield name="RXPL" caption="Receive Pulse Length" mask="0xFF"/>
        </register>
        <register name="INTENCLR" offset="0x14" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="USART Interrupt Enable Clear">
          <bitfield name="DRE" caption="Data Register Empty Interrupt Disable" mask="0x1"/>
          <bitfield name="TXC" caption="Transmit Complete Interrupt Disable" mask="0x2"/>
          <bitfield name="RXC" caption="Receive Complete Interrupt Disable" mask="0x4"/>
          <bitfield name="RXS" caption="Receive Start Interrupt Disable" mask="0x8"/>
          <bitfield name="CTSIC" caption="Clear To Send Input Change Interrupt Disable" mask="0x10"/>
          <bitfield name="RXBRK" caption="Break Received Interrupt Disable" mask="0x20"/>
          <bitfield name="ERROR" caption="Combined Error Interrupt Disable" mask="0x80"/>
        </register>
